---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureMessageAccessor
source: html/4b24ff38-e48e-4f87-ae36-2dcb0b552a6e.htm
---
# FailureMessageAccessor Properties

Specifies whether the .NET object represents a valid Revit entity.